Repository: yshialexandra/Optimizing_LLM_Chinese_Translation_through_Syntactic_Feature_Extraction_and_Representation_Editing
Catalog: yshibachlorpaper/Yiyan_tmx/M09B.tmx
Source language: en_us
Languages: zh_cn

source: Memnoch the Devil
zh_cn: 恶魔迈诺克

source: Chapter 20 THE GARDEN of Waiting
zh_cn: 第20章 等待花园

source: The tranquil and radiant place before the Heavenly Gates. A place from which souls return from time to time, when death brings them into it, and they are then told that it is not the moment, and they can go home again.
zh_cn: 它位于天堂之门前，这里安宁寂静，散发着耀眼荣光，时而会有被死亡引领而至的灵魂回归此处，随后得知时机未到，可以再次返回尘世。

source: In the distance, beneath the shining cobalt sky, I saw the Newly Dead greet the Older Dead. Gathering after gathering. I saw the embraces, heard the exclamations.
zh_cn: 我看到远处晴朗明亮的深蓝色天空之下，较早离世的往者们正在迎接新来的灵魂，欢聚时刻不断重复，它们相互拥抱，发出感叹。

source: Out of the corner of my eyes, I saw the dizzyingly high walls of Heaven, and Heaven's gates.
zh_cn: 透过眼角余光，我看见天堂大门和令人眩晕的天堂高墙。

source: This time I saw the angels, less solid than all the rest, chorus after chorus, moving through the skies, unbound and dipping down at will into the little crowds of mortals crossing the bridge.
zh_cn: 就在此时，我见到了天使，它们飘忽空灵，齐声吟唱着颂歌飞越天空，无拘无束，随心所欲地降临于一小群正在过桥的凡人之间。

source: Shifting between visibility and invisibility, the angels moved, watched, drifted upwards to fade into the inexhaustible blue of the sky.
zh_cn: 天使们时而显形，时而隐身，注视着发生的一切，随后冲上天际，消失在天空的无边湛蓝中。

source: The sounds of Heaven were faint and achingly seductive as they came from beyond the walls.
zh_cn: 高墙那头隐隐传来天堂之声，带着诱惑人心的魔力。

source: I could close my eyes and almost see the sapphirine colors!
zh_cn: 要是我闭上眼睛，就能够看见那蓝宝石般的色彩！

source: All songs sang the same refrain: "Come in, come here, come inside, be with us.
zh_cn: 天籁般的和声不断重复唱着：“来吧，来吧，快进来吧，来到我们身边。

source: Chaos is no more. This is Heaven."
zh_cn: 这里没有尘世纷扰，天堂就在眼前。”

source: But I was far from all this, in a little valley.
zh_cn: 但是这一切都离我遥不可及。

source: I sat amid wildflowers, tiny white and yellow wildflowers, on the grass bank of the stream which all souls cross to get into Heaven, only here it seemed no more than any magnificent rushing stream.
zh_cn: 我正坐在一个小山谷的野花丛中，这些不起眼的黄、白色花朵点缀在翠绿草坪上，边上流淌着一条小溪，那是灵魂进入天堂的必经之地，但是眼下，它和所有壮观的急流毫无二致。

source: Or rather, it sang a song that said?
zh_cn: 更确切地说，它正在唱着一首歌，歌词是?

source: after smoke and war, after soot and blood, after stench and pain?
zh_cn: 在烟雾和战争之后，在烟尘和鲜血之后，在恶臭和痛苦之后?

source: All streams are as magnificent as this stream.
zh_cn: 所有溪流都是如此壮观。

source: Water sings in multiple voices as it slides over rocks and down through tiny gullies and rushes abruptly over rises in the earth so that it may again tumble in a mingling of fugue and canon. While the grass bends its head to watch.
zh_cn: 溪流欢快的歌唱着多重奏，向上滑过岩石，向下穿过狭沟，接着又猛然冲过隆起的土地，混合着赋格曲和轮唱曲的旋律再次尽情翻滚，岸边的青草们低垂着脑袋静静注视着。

source: I rested against the trunk of a tree, what the peach tree might be if she bloomed forever, both blossoms and fruit, so that she was never bare of either, and her limbs hung down not in submission, but with this richness, this fragrance, this offering, this fusion of two cycles into one eternal abundance.
zh_cn: 我倚靠着一棵桃树，如果这棵桃树永远花果满枝会如何呢？她的枝条将不会以屈服的姿态低垂，而会由于满树的花朵、累累的果实和花果满枝的丰盈幸福折腰。

source: Above, amid fluttering petals, the supply of which seemed inexhaustible and never alarming, I saw the fleeting movement of tiny birds.
zh_cn: 头顶的花瓣纷纷飘落，下着一场似乎无穷无尽的花雨，小巧的鸟儿们在花雨中飞掠而过。

source: And beyond that, angels, and angels, and angels, as if they were made of air, the light luminous glittering spirits so faint as to vanish at times in one brilliant breath of the sky.
zh_cn: 更远处，天使们聚集在一起，这些闪闪发光的仙灵就好像是由空气组成的，如此稀薄轻盈，时不时便会消失在天空呼出的一丝欢愉微风中。

source: The Paradise of murals; the Paradise of mosaics. Only no form of art can touch this. Question those who have come and gone.
zh_cn: 无数壁画和马赛克中都曾描绘过天堂，但是任何艺术形式都无法将其真正呈现，去问问那些曾有幸造访于此的人们吧——

source: Those whose hearts have stopped on an operating table, so that their souls flew to this garden, and then were brought back down into articulate flesh.
zh_cn: 他们的心脏曾一度在手术台上停止搏动，脱离躯壳的灵魂随之飞往这座花园，但接着又返回了自己的肉体。

source: Nothing can touch it.
zh_cn: 没有任何艺术形式能够将天堂完美呈现。

source: The cool, sweet air surrounded me, slowly removing, layer by layer, the soot and filth that clung to my coat and my shirt.
zh_cn: 凉爽、甜蜜的空气包围着我，它们缓慢地，一层层地剥离着粘附在我外套和衬衫上的烟尘污垢。

source: Suddenly, as if waking to life again from nightmare, I reached inside my shirt and drew out the veil. I unfolded it and held it by its two edges.
zh_cn: 暮然之间，我仿佛于噩梦中苏醒，从自己的衬衫中掏出面纱，拽着其中两角铺展开来。

source: The face burned in it, the dark eyes staring at me, the blood as brilliantly red as before, the skin the perfect hue, the depth almost holographic, though the whole expression moved very faintly as the veil moved on the breeze.
zh_cn: 面纱中的脸庞炙热地燃烧着，幽黑的眼睛凝视着我，血液如同先前一般艳红，皮肤则泛着玉石的色泽，虽然在微风拂过面纱时，整个表情出现了极其细微的波动，但这一切依然真实的仿佛全息影像。

source: Nothing had been smeared, torn, or lost.
zh_cn: 完全见不到脏污，撕裂，或者损毁。

source: I felt myself gasp, and my heart speeded dangerously. The heat flooded to my own face.
zh_cn: 我感到一阵窒息，心跳开始危险地加速，滚烫的血液冲上脸庞。

source: The brown eyes were steady in their gaze as they had been at that moment, not closing for the soft finely woven fabric.
zh_cn: 柔软细腻的织物中，那双棕褐色的眼睛并没有阖上，而是像那时一样冷静地凝视着。

source: I drew the whole veil close to me, then folded it up again, almost in a panic, and shoved it tight against my skin this time, inside my shirt.
zh_cn: 我将整幅面纱拽到近前，带着几乎恐慌的情绪重新叠起，这次我将它塞进了衬衫里，紧紧贴合着自己的肌肤。

source: I struggled to restore all the buttons to their proper holes. My shirt was all right.
zh_cn: 随后我费了好大劲，才重新系上了衬衫纽扣。

source: My coat was filthy though intact, but all its buttons were gone, even the buttons that had graced the sleeves and had been no longer of any use and were merely decorative.
zh_cn: 衬衫并没有脏污破裂，大衣也没有破裂，不过非常肮脏，此外所有纽扣都不见了，甚至连用来装饰的袖扣也一并消失了踪影。
